# У Кати насыщенный день на работе. Ей надо передать n разных договоров коллегам. Все встре- чи происходят на разных этажах, а между этажами можно перемещаться только по лестничным пролетам — считается, что это улучшает физическую форму сотрудников. Прохождение каждого пролета занимает ровно 1 минуту.
# Сейчас Катя на парковочном этаже, планирует свой маршрут. Коллег можно посетить в любом порядке, но один из них покинет офис через t минут. С парковочного этажа лестницы нет — только лифт, на котором можно подняться на любой этаж. В итоге план Кати следующий: Подняться на лифте на произвольный этаж. Считается, что лифт поднимается на любой этаж за 0 минут. Передать всем коллегам договоры, перемещаясь между этажами по лестнице. Считается, что договоры на этаже передаются мгновенно. В первые t минут передать договор тому коллеге, который планирует уйти. Пройти минимальное количество лестничных пролетов.
# Помогите Кате выполнить все пункты ее плана.
# ------------------------------------------
def f(floor, s, e):
    return abs(floor[e] - floor[s])


n, t = map(int, input().split())
floors = list(map(int, input().split()))
c = int(input())

res = f(floors, 0, n-1)
if f(floors, 0, c-1) > t and f(floors, c-1, n-1) > t:
    res += min(f(floors, 0, c-1), f(floors, c-1, n-1))

print(res)
# РЕШЕНИЕ ПОЛНОЕ
